In [31]:
import pandas as pd
import numpy as np
# s = pd.Series(np.random.randint(0, 6), index=['a', 'b', 'c', 'd', 'e'])
arr = np.array([np.random.randint(1, 6) for i in range(5)])
s = pd.Series(arr, index=['a', 'b', 'c', 'd', 'e'])   # one-dimensional data set
print(s)

a    3
b    4
c    1
d    2
e    1
dtype: int32

In [36]:
data = {
    'Country'  : ['India', 'Japan', 'China', 'America'],
    'Currency' : ['Rupee', 'Yen', 'Yuan', 'Dollar'], 
    'Population' : [1415199835, 123951692, 1443981565, 338289857]
}

df = pd.DataFrame(data, columns=['Country', 'Currency', 'Population'], index=[1, 2, 3, 4])

In [37]:
df.drop('Country', axis=1)
s.drop(['a', 'c'])
print(df)
print(s)

   Country Currency  Population
1    India    Rupee  1415199835
2    Japan      Yen   123951692
3    China     Yuan  1443981565
4  America   Dollar   338289857
a    3
b    4
c    1
d    2
e    1
dtype: int32

In [39]:
df.sort_values(by='Country')
df.rank
df

   Country Currency  Population
1    India    Rupee  1415199835
2    Japan      Yen   123951692
3    China     Yuan  1443981565
4  America   Dollar   338289857

In [41]:
pd.read_csv('animal_data.csv', header=None, nrows=5)

     0       1         2         3
0  NaN  animal  strength      type
1    a    lion        90      wild
2    b   tiger        82      wild
3    c    deer        36  domestic
4    d   snake        68      wild